owhinata/stm32f746g-disco/port/guix/guix_display.c
/*
 * SPDX-License-Identifier: MIT
 * Copyright (c) 2026 ThreadX Shell Project
 */
/**
 * @file    guix_display.c
 * @brief   GUIX 565rgb display driver on the LTDC double buffer (issue #55).
 *
 * See guix_display.h for the design.  Key facts verified against GUIX v6.5.1:
 *   - The 565rgb software driver writes the *native* 16-bit colour straight to
 *     memory, so the GX_COLOR handed to horizontal_line_draw is already a packed
 *     RGB565 value in its low 16 bits.  For a DMA2D register-to-memory fill it
 *     must still be expanded to ARGB8888 -- the F7 HAL interprets the R2M colour
 *     as ARGB8888 and re-packs it to the output format (same quirk as #53).
 *   - gx_draw_context_pitch is in PIXELS (it is set from canvas->
 *     gx_canvas_x_resolution and used as a USHORT* row increment), not bytes.
 *   - GX_RECTANGLE edges are all inclusive.
 *   - gx_canvas_memory is a GX_COLOR* the 565 driver casts to USHORT*; repointing
 *     it between the two LTDC buffers in the toggle is exactly how GUIX hardware
 *     double buffering is meant to work.
 */
#include "guix_display.h"        /* CAM_VIEW_* preview geometry (#59 B2) */
#include "ltdc_display.h"

#include "gx_display.h"          /* _gx_display_driver_565rgb_setup proto */

#include "stm32f7xx_hal.h"

#define LOG_TAG "guix"
#include "log.h"

#include <stdint.h>
#include <string.h>             /* memcpy: corrective camera-rect CPU fallback (#59) */

/* DMA2D handle private to GUIX.  DMA2D is one engine shared with ltdc_display.c;
   we serialize on ltdc_lock (ltdc_lock_frame/unlock_frame) and fully reconfigure
   the engine each op, so a separate handle is safe.  The DMA2D clock is enabled
   by ltdc_init(), which always runs before GUIX starts. */
static DMA2D_HandleTypeDef hdma2d_gui;

/* Saved software driver pointers we fall back to for cases DMA2D will not take
   (partially-transparent brush, compressed/palette/alpha-plane pixelmaps,
   overlapping block moves, cacheable-SRAM sources).  Captured in
   guix_display_driver_setup right after _gx_display_driver_565rgb_setup(). */
static VOID (*sw_horizontal_line_draw)(GX_DRAW_CONTEXT *context, INT x1, INT x2,
                                       INT ypos, INT width, GX_COLOR color);
static VOID (*sw_pixelmap_draw)(GX_DRAW_CONTEXT *context, INT x, INT y,
                                GX_PIXELMAP *pmp);
static VOID (*sw_pixelmap_blend)(GX_DRAW_CONTEXT *context, INT x, INT y,
                                 GX_PIXELMAP *pmp, GX_UBYTE alpha);
static VOID (*sw_canvas_copy)(GX_CANVAS *canvas, GX_CANVAS *composite);
static VOID (*sw_canvas_blend)(GX_CANVAS *canvas, GX_CANVAS *composite);

/* GUIX rectangle utilities used by the canvas composite overrides. */
extern UINT    _gx_utility_rectangle_shift(GX_RECTANGLE *r, GX_VALUE dx, GX_VALUE dy);
extern GX_BOOL _gx_utility_rectangle_overlap_detect(GX_RECTANGLE *a, GX_RECTANGLE *b,
                                                    GX_RECTANGLE *overlap);

/* DMA2D may read a source only where the data is guaranteed coherent without a
   cache clean: the MPU non-cacheable SDRAM (frame buffers, camera frames,
   GUIX canvases placed there) or read-only Flash (const Studio pixelmaps).  A
   pixelmap in cacheable, CPU-written SRAM could have dirty D-cache lines DMA2D
   would miss, so those fall back to the software path. */
static bool guix_dma2d_src_ok(const void *p)
{
	uintptr_t a = (uintptr_t)p;

	if (a >= 0xC0000000u && a < 0xC0800000u)   /* external SDRAM (non-cacheable) */
		return true;
	if (a >= 0x08000000u && a < 0x08100000u)   /* internal Flash (read-only)     */
		return true;
	return false;
}

/* RGB565 (low 16 bits) -> ARGB8888 (0x00RRGGBB) for DMA2D R2M (see header / #53). */
static uint32_t rgb565_to_argb8888(uint16_t c)
{
	uint32_t r = (uint32_t)(c >> 11) & 0x1Fu;
	uint32_t g = (uint32_t)(c >> 5) & 0x3Fu;
	uint32_t b = (uint32_t)c & 0x1Fu;

	r = (r << 3) | (r >> 2);          /* 5 -> 8 */
	g = (g << 2) | (g >> 4);          /* 6 -> 8 */
	b = (b << 3) | (b >> 2);          /* 5 -> 8 */
	return (r << 16) | (g << 8) | b;
}

/* Run an already-configured 2-operand DMA2D transfer on hdma2d_gui (R2M fill or
   M2M blit -- same HAL_DMA2D_Start/_Start_IT signature) to completion: large
   transfers block on the completion IRQ, small ones poll (#64; threshold
   LTDC_DMA2D_IT_MIN_PIXELS).  Guarantees DMA2D is left IDLE on failure -- the
   camera sink's CPU fallback (cam_rect_refresh) relies on it.  Caller holds
   ltdc_lock.  Returns true on a clean completion. */
static bool guix_dma2d_run(uint32_t pdata, uint32_t dst, uint32_t w, uint32_t h)
{
	if ((uint64_t)w * h >= LTDC_DMA2D_IT_MIN_PIXELS) {
		ltdc_dma2d_arm_it(&hdma2d_gui);
		if (HAL_DMA2D_Start_IT(&hdma2d_gui, pdata, dst, w, h) != HAL_OK) {
			ltdc_dma2d_disarm_it(&hdma2d_gui);    /* leaves the engine idle */
			return false;
		}
		return ltdc_dma2d_wait_it(&hdma2d_gui, 30);   /* disarms -> idle */
	}
	if (HAL_DMA2D_Start(&hdma2d_gui, pdata, dst, w, h) != HAL_OK)
		return false;
	if (HAL_DMA2D_PollForTransfer(&hdma2d_gui, 30) == HAL_OK)
		return true;
	/* Poll timeout returns without clearing CR.START -- the engine may still be
	   writing the destination.  Abort so a failed transfer always leaves DMA2D
	   idle (cam_rect_refresh's CPU follow-up relies on it, and it keeps the next
	   op's re-init clean, #59). */
	if ((DMA2D->CR & DMA2D_CR_START) != 0u)
		(void)HAL_DMA2D_Abort(&hdma2d_gui);
	return false;
}

/* DMA2D register-to-memory fill of a w x h RGB565 block; @p line_off u16 skipped
   at each row end (= dst stride in px - w).  Serialized on ltdc_lock. */
static void guix_dma2d_fill(uint16_t *dst, uint16_t color, uint32_t w,
                            uint32_t h, uint32_t line_off)
{
	if (dst == NULL || w == 0u || h == 0u)
		return;

	ltdc_lock_frame();
	hdma2d_gui.Instance          = DMA2D;
	hdma2d_gui.Init.Mode         = DMA2D_R2M;
	hdma2d_gui.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
	hdma2d_gui.Init.OutputOffset = line_off;
	if (HAL_DMA2D_Init(&hdma2d_gui) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 1) == HAL_OK)
		(void)guix_dma2d_run(rgb565_to_argb8888(color),
		                     (uint32_t)(uintptr_t)dst, w, h);
	ltdc_unlock_frame();
}

/* DMA2D memory-to-memory copy of a w x h RGB565 block with separate u16 row
   offsets for dst/src.  Source and destination must NOT overlap.  Serialized on
   ltdc_lock.  Returns 0 on a completed transfer, -1 on bad args or any DMA2D
   failure (init/config/start/poll) -- the camera preview sink needs the status
   to keep the last good frame on failure; the GUIX draw paths ignore it. */
static int guix_dma2d_blit(uint16_t *dst, const uint16_t *src, uint32_t w,
                           uint32_t h, uint32_t dst_off, uint32_t src_off)
{
	int rc = -1;

	if (dst == NULL || src == NULL || w == 0u || h == 0u)
		return -1;

