owhinata/stm32f746g-disco/port/guix/guix_display.c
	ltdc_lock_frame();
	hdma2d_gui.Instance          = DMA2D;
	hdma2d_gui.Init.Mode         = DMA2D_M2M;
	hdma2d_gui.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
	hdma2d_gui.Init.OutputOffset = dst_off;
	hdma2d_gui.LayerCfg[1].AlphaMode      = DMA2D_NO_MODIF_ALPHA;
	hdma2d_gui.LayerCfg[1].InputAlpha     = 0xFFu;
	hdma2d_gui.LayerCfg[1].InputColorMode = DMA2D_INPUT_RGB565;
	hdma2d_gui.LayerCfg[1].InputOffset    = src_off;
	/* guix_dma2d_run completes the transfer (IT for large, poll for small) and
	   leaves DMA2D idle on failure, so cam_rect_refresh's CPU fallback is safe. */
	if (HAL_DMA2D_Init(&hdma2d_gui) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 1) == HAL_OK &&
	    guix_dma2d_run((uint32_t)(uintptr_t)src, (uint32_t)(uintptr_t)dst, w, h))
		rc = 0;
	ltdc_unlock_frame();
	return rc;
}

/* DMA2D memory-to-memory-with-blending of a w x h block over an RGB565
   destination (read-modify-write).  Foreground (layer 1) is @p src in @p fg_cmode
   with alpha mode @p fg_amode / @p fg_alpha; background (layer 0) is the RGB565
   destination itself; output is RGB565.  Serialized on ltdc_lock.  RM0385 §9.3.6
   (blender) + §9.3.5 (alpha modes) + §9.3.7 (output PFC). */
static void guix_dma2d_blend(uint16_t *dst, const void *src, uint32_t w,
                             uint32_t h, uint32_t dst_off, uint32_t src_off,
                             uint32_t fg_cmode, uint32_t fg_amode, uint8_t fg_alpha)
{
	if (dst == NULL || src == NULL || w == 0u || h == 0u)
		return;

	ltdc_lock_frame();
	hdma2d_gui.Instance          = DMA2D;
	hdma2d_gui.Init.Mode         = DMA2D_M2M_BLEND;
	hdma2d_gui.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
	hdma2d_gui.Init.OutputOffset = dst_off;
	/* Foreground = source. */
	hdma2d_gui.LayerCfg[1].AlphaMode      = fg_amode;
	hdma2d_gui.LayerCfg[1].InputAlpha     = fg_alpha;
	hdma2d_gui.LayerCfg[1].InputColorMode = fg_cmode;
	hdma2d_gui.LayerCfg[1].InputOffset    = src_off;
	/* Background = destination (read-modify-write), same offset as output. */
	hdma2d_gui.LayerCfg[0].AlphaMode      = DMA2D_NO_MODIF_ALPHA;
	hdma2d_gui.LayerCfg[0].InputAlpha     = 0xFFu;
	hdma2d_gui.LayerCfg[0].InputColorMode = DMA2D_INPUT_RGB565;
	hdma2d_gui.LayerCfg[0].InputOffset    = dst_off;
	if (HAL_DMA2D_Init(&hdma2d_gui) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 0) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 1) == HAL_OK) {
		/* Blend has three operands (BlendingStart), so it cannot use
		   guix_dma2d_run; inline the same size-thresholded poll/IT choice (#64).
		   Blends are icons/overlays, almost always below the threshold -> poll. */
		if ((uint64_t)w * h >= LTDC_DMA2D_IT_MIN_PIXELS) {
			ltdc_dma2d_arm_it(&hdma2d_gui);
			if (HAL_DMA2D_BlendingStart_IT(&hdma2d_gui,
			        (uint32_t)(uintptr_t)src, (uint32_t)(uintptr_t)dst,
			        (uint32_t)(uintptr_t)dst, w, h) == HAL_OK)
				(void)ltdc_dma2d_wait_it(&hdma2d_gui, 30);
			else
				ltdc_dma2d_disarm_it(&hdma2d_gui);
		} else if (HAL_DMA2D_BlendingStart(&hdma2d_gui,
		               (uint32_t)(uintptr_t)src, (uint32_t)(uintptr_t)dst,
		               (uint32_t)(uintptr_t)dst, w, h) == HAL_OK) {
			HAL_DMA2D_PollForTransfer(&hdma2d_gui, 30);
		}
	}
	ltdc_unlock_frame();
}

void guix_display_fill_back(uint16_t rgb565)
{
	uint16_t *back = ltdc_back_buffer();

	if (back != NULL)
		guix_dma2d_fill(back, rgb565, LTDC_LCD_WIDTH, LTDC_LCD_HEIGHT, 0u);
}

int guix_display_copy_rgb565(uint16_t *dst, const uint16_t *src, uint32_t w,
                             uint32_t h, uint32_t dst_off, uint32_t src_off)
{
	return guix_dma2d_blit(dst, src, w, h, dst_off, src_off);
}

/*
 * DMA2D-accelerated horizontal line / solid fill.  GUIX fills widget rectangles
 * by calling this once per scanline-band; @p width is the band height.  The
 * software driver pre-clips, so the inputs are already inside the canvas -- we
 * mirror its contract exactly and only swap the inner pixel loop for a DMA2D R2M
 * rectangle fill.  A partially transparent brush (alpha != 0xff) falls back to
 * the saved software routine, which does the per-pixel blend.
 */
static VOID guix_horizontal_line_draw(GX_DRAW_CONTEXT *context, INT xstart,
                                      INT xend, INT ypos, INT width,
                                      GX_COLOR color)
{
	INT len   = xend - xstart + 1;
	INT pitch = context->gx_draw_context_pitch;   /* pixels per row */
	uint16_t *dst;

#if defined(GX_BRUSH_ALPHA_SUPPORT)
	GX_UBYTE alpha = context->gx_draw_context_brush.gx_brush_alpha;

	if (alpha == 0)
		return;                                /* fully transparent: nothing */
	if (alpha != 0xffu) {
		sw_horizontal_line_draw(context, xstart, xend, ypos, width, color);
		return;                                /* per-pixel blend in software */
	}
#endif
	if (len <= 0 || width <= 0)
		return;

	dst = (uint16_t *)context->gx_draw_context_memory +
	      (uint32_t)ypos * (uint32_t)pitch + (uint32_t)xstart;
	guix_dma2d_fill(dst, (uint16_t)color, (uint32_t)len, (uint32_t)width,
	                (uint32_t)(pitch - len));
}

/* ===== #59 Lever B2: camera live-preview copy-forward elimination ===========
 *
 * The camera icon (CAM_VIEW_W x CAM_VIEW_H at CAM_VIEW_X,CAM_VIEW_Y) is fully
 * repainted from cam_view_buf every preview frame, so forwarding it in the
 * buffer toggle is wasted SDRAM bandwidth (one ~150 KB DMA2D blit per displayed
 * frame) and a contributor to the DCMI DMA FIFO errors of #59.  We skip that
 * copy but must never present a STALE camera rect (a later non-camera flip could
 * otherwise show an older frame -> visible regression).  Correctness is enforced
 * at PRESENT time by a per-buffer freshness flag:
 *
 *   cam_buf_stale[i] == false   <=>   ltdc_fb[i]'s camera rect already holds the
 *                                     latest cam_view_buf content.
 *
 *   - a new view frame (guix_display_cam_view_store) makes BOTH buffers stale;
 *   - a full-rect camera pixelmap draw clears the drawn (back) buffer;
 *   - before each flip, if the buffer about to be presented is still stale we do
 *     a corrective view->buffer copy first.
 *
 * Every stale-flag transition is kept in the SAME ltdc_lock section as the DMA2D
 * copy it reflects, so the producer thread cannot advance cam_view_buf between a
 * copy and its flag update (a false-negative would present stale pixels). */
static bool      cam_preview_active;   /* session armed (begin..end): store() ok  */
static bool      cam_visible;          /* camera screen on display (SHOW..HIDE):
                                          gates the toggle's corrective + skip so
                                          we never stamp camera pixels onto, or
                                          drop a forward-copy on, another screen  */
static uint16_t *cam_view_data;        /* cam_view_buf base (registered by begin) */
static bool      cam_buf_stale[2];     /* per LTDC buffer; invariant above        */
/* Camera icon geometry on the panel (set by begin(), #69 variable resolution).
   Defaults to the QVGA centred placement; rect/blit helpers read these instead of
   the compile-time CAM_VIEW_* constants so the preview can run at qqvga/qvga/
   480x272.  CAM_RECT bounds are cam_x..cam_x+cam_w-1 / cam_y..cam_y+cam_h-1. */
static uint16_t  cam_x = CAM_VIEW_X, cam_y = CAM_VIEW_Y;
static uint16_t  cam_w = CAM_VIEW_W, cam_h = CAM_VIEW_H;

/* True if screen-space rect r lies fully inside the camera icon rect. */
static bool rect_in_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   >= (GX_VALUE)cam_x &&
	       r->gx_rectangle_top    >= (GX_VALUE)cam_y &&
	       r->gx_rectangle_right  <= (GX_VALUE)(cam_x + cam_w - 1) &&
	       r->gx_rectangle_bottom <= (GX_VALUE)(cam_y + cam_h - 1);
}

/* True if screen-space clip rect r fully COVERS the camera icon rect. */
static bool rect_covers_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   <= (GX_VALUE)cam_x &&
	       r->gx_rectangle_top    <= (GX_VALUE)cam_y &&
	       r->gx_rectangle_right  >= (GX_VALUE)(cam_x + cam_w - 1) &&
	       r->gx_rectangle_bottom >= (GX_VALUE)(cam_y + cam_h - 1);
}

/* Corrective copy of the full camera rect (cam_view_buf -> @p fb at the icon
   position).  Caller holds ltdc_lock.  Tries DMA2D first and, on the rare DMA2D
   failure, falls back to a row-by-row CPU copy so the presented camera rect is
   ALWAYS made current -- the toggle therefore never has to skip the flip (which
   would strand that cycle's non-camera draws).  Both buffers are MPU
   non-cacheable SDRAM, so the CPU copy is coherent with no cache maintenance.
   Returns 0 when the rect was refreshed, -1 only on a NULL buffer (cannot happen
   while cam_visible, since begin() set cam_view_data). */
static int cam_rect_refresh(uint16_t *fb)
{
	uint16_t *dst;
	const uint16_t *src;
	uint32_t y;

	if (fb == NULL || cam_view_data == NULL)
		return -1;
	dst = fb + (uint32_t)cam_y * LTDC_LCD_WIDTH + cam_x;
	if (guix_dma2d_blit(dst, cam_view_data, cam_w, cam_h,
	                    LTDC_LCD_WIDTH - cam_w, 0u) == 0)
		return 0;
	/* DMA2D failed.  guix_dma2d_blit aborts a timed-out transfer, so the engine
	   is normally idle now; only run the CPU copy once that is confirmed (START
	   clear).  If the abort itself failed the engine is wedged (hard DMA2D
	   fault) -- do NOT race it with a CPU write; report failure and leave the
	   buffer stale. */
	if ((DMA2D->CR & DMA2D_CR_START) != 0u)
		return -1;
	src = cam_view_data;
	for (y = 0; y < cam_h; y++) {
		memcpy(dst, src, (size_t)cam_w * sizeof(uint16_t));
		dst += LTDC_LCD_WIDTH;
		src += cam_w;
	}
	return 0;
}

/* Register the view buffer + camera-rect geometry and arm B2 for a preview
   session (#69 variable resolution).  Both LTDC buffers start stale so the first
   frames are corrected before present.  Returns 0 on success, -1 if the geometry
   is invalid (NULL buffer, zero size, or out of the 480x272 panel) -- in which
   case B2 is left DISARMED (cam_view_data NULL) so a bad offset can never reach
   the DMA2D blits.  Runs under ltdc_lock. */
int guix_display_cam_preview_begin(uint16_t *view_buf, uint16_t w, uint16_t h,
                                   uint16_t x, uint16_t y)
{
	if (view_buf == NULL || w == 0u || h == 0u ||
	    (uint32_t)x + w > LTDC_LCD_WIDTH || (uint32_t)y + h > LTDC_LCD_HEIGHT)
		return -1;
	ltdc_lock_frame();
	cam_view_data      = view_buf;
	cam_x              = x;
	cam_y              = y;
	cam_w              = w;
	cam_h              = h;
	cam_buf_stale[0]   = true;
	cam_buf_stale[1]   = true;
	cam_preview_active = true;
	ltdc_unlock_frame();
	return 0;
}

